InformationRegisters/НастройкаАктуальности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НастройкаАктуальности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
						<v8:Type>cfg:CatalogRef.УсловияНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.МодификаторыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаАктуальности/Forms/ФормаСохраненияНастроек/Ext/Form/Module.bsl
&НаКлиенте
Перем УдаляемаяНастройка;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Владелец 	= ЭтаФорма.Параметры.Владелец;
	ИмяОбъекта 	= ЭтаФорма.Параметры.ИмяОбъекта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьТаблицуНастроекНаСервере(ИмяОбъекта, Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекНаименованиеНастройкиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные 		= Элементы.ТаблицаНастроек.ТекущиеДанные;
	ТекущиеДанные.Дата 	= ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Отказ = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаНастроек.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Настройка 	= ТекущиеДанные.НаименованиеНастройки;
	Дата 		= ТекущиеДанные.Дата;
	
	СохранитьНаСервере(Отказ, ИмяОбъекта, Настройка, Дата);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(Отказ, ИмяОбъекта, Настройка, Дата)
	
	
	НачатьТранзакцию();
	
	РегистрыСведений.НастройкаАктуальности.СохранитьНастройку(Отказ, ИмяОбъекта, Настройка, Дата);
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
	КонецЕсли; 
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНастроекНаСервере(ИмяОбъекта, Владелец)
	
	Настройки = РегистрыСведений.НастройкаАктуальности.СформироватьТаблицуНастроек(ИмяОбъекта, Владелец);
	
	ЗначениеВРеквизитФормы(Настройки, "ТаблицаНастроек");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные 		= Элементы.ТаблицаНастроек.ТекущиеДанные;
	УдаляемаяНастройка 	= ТекущиеДанные.НаименованиеНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПослеУдаления(Элемент)
	
	Если УдаляемаяНастройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	НачатьТранзакцию();
	
	РегистрыСведений.НастройкаАктуальности.УдалитьНастройкуИзРегистра(Отказ, ИмяОбъекта, УдаляемаяНастройка);
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
	КонецЕсли; 
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры
